{
    "experiences": [
        {
            "position": "Software Engineer (2022-2025) - Contract",
            "frontend": "Vue/Nuxt, Svelte/Sveltekit, Shadcn Svelte / TailwindCSS",
            "backend": "Storefront, Shopify GraphQL, Knex.js, PostgreSQL, Drizzle ORM, Supabase",
            "company": "Pilothouse Digital",
            "address": "#1011 Government St, Victoria, BC V8W 1X6, Canada",
            "stacks": [
                "vue",
                "nuxt",
                "svelte",
                "tailwind",
                "shadcn",
                "node",
                "postgresql",
                "prisma",
                "storefront",
                "supabase"
            ],
            "roles": [
                {
                    "task": "Developerd a Headless CMS E-commerce solution for Shopify stores through backend migrations and service integrations, that had an impact on store scalability and modernization.",
                    "subtask": [
                        "Implement AI-powered component store generation through Svelte components and Tailwind CSS, that had an impact on faster development cycles.",
                        "Achieved a high-performance Shopify store conversion through SvelteKit migration, that had an impact on site speed and user experience.",
                        "Implemented seamless drag-and-drop functionality through custom module development, that had an impact on store page flexibility and usability.",
                        "Created multiple modules (components) for a store template, enhancing the homepage, collection pages, and product detail pages (PDP).",
                        "Implemented comprehensive cart functionality through Storefront GraphQL API integration, that had an impact on efficient e-commerce transactions.",
                        "Enhanced store branding through DaisyUI theming, that had an impact on consistent customer experience.",
                        "Added upselling capabilities through third-party Shopify integrations (Rebuy, reviews API), that had an impact on customer engagement and revenue.",
                        "Achieved reliable software quality through Vitest-based module and component testing, that had an impact on product stability.",
                        "Formulated storefront GraphQL queries and mutations for headless CMS architecture."
                    ]
                },
                {
                    "task": "Convert Liquid-based Shopify store into modern Javascript framework using Nuxt/Vue.",
                    "subtask": [
                        "Achieved pixel-perfect design conversion for the site using solely Nuxt, eliminating dependency on any CMS."
                    ]
                }
            ]
        },
        {
            "position": "Fullstack Developer (2021-2022) - Fulltime",
            "frontend": "React, Next.js, Material UI, Vue/Vuetify",
            "backend": "JS-force, Salesforce, Node, Express",
            "company": "ArchIntel Corp.",
            "address": "#8245 Boone Blvd # 650, Tysons, VA 22182, Estados Unidos",
            "stacks": [
                "vue",
                "react",
                "next",
                "vuetify",
                "materialui",
                "node",
                "express"
            ],
            "roles": [
                {
                    "task": "Developed a frontend system for a video interview platform through React/Next.js development, that had an impact on productivity for seven users including video editors.",
                    "subtask": []
                },
                {
                    "task": "Achieved continuous system reliability through maintenance of the social media chassis, that had an impact on smooth US team operations.",
                    "subtask": []
                },
                {
                    "task": "Developed a digital asset library system through Node.js, MongoDB, and React, that had an impact on secure file storage and accessibility.",
                    "subtask": []
                }
            ]
        },
        {
            "position": "Full Stack Developer (2020-2021) - Fulltime",
            "frontend": "Vue/Vuetify",
            "backend": "Laravel API",
            "company": "Elite Anywhere Corp.",
            "address": "#82585 Showcase Pkwy Indio, CA 92203",
            "stacks": [
                "vue",
                "vuetify",
                "laravel"
            ],
            "roles": [
                {
                    "task": "Migrating of a logistics web application through Laravel Vue SPA implementation, that had an impact on improved user experience and system performance.",
                    "subtask": []
                }
            ]
        },
        {
            "position": "Jr. Web Developer (2019-2020) - Fulltime",
            "frontend": "Vue/Nuxt/Vuetify, React Native",
            "backend": "Firebase Firestore",
            "company": "TaraPhilippines",
            "address": "#2 Roman Ayson Rd,. Upper Bokawkan, Baguio City",
            "stacks": [
                "vue",
                "nuxt",
                "vuetify",
                "react",
                "node",
                "firebase"
            ],
            "roles": [
                {
                    "task": "Developed Skood (Admin Dashboard) Food Delivery App of Baguio City.",
                    "subtask": [
                        "Achieved a city-wide food delivery platform (Skood) through dashboards for admins, sellers, and riders, that had an impact on efficient order dispatching and local commerce growth.",
                        "Implemented backend dispatching automation through server-side Node.js and Firebase, that had an impact on faster order processing and operational efficiency."
                    ]
                }
            ]
        }
    ]
}